Implementing #41 did not seem to resolve this, see https://github.com/goldstack/goldstack/runs/4745604598

Same error occurs:

```
project-backend-lambda-api lambda-api-1 infra-up❌ Failed: Command failed: yarn workspace lambda-api-1 infra apply prod

Error: error creating API Gateway v2 route: BadRequestException: Route key is required

  on lambda_routes.tf line 43, in resource "aws_apigatewayv2_route" "this":
  43: resource "aws_apigatewayv2_route" "this" {


Command failed: docker run --rm -v "/tmp/set/project-backend-lambda-api/packages/lambda-api-1/infra/aws":/app  -e AWS_ACCESS_KEY_ID=*** -e AWS_SECRET_ACCESS_KEY=*** -e AWS_SESSION_TOKEN= -e AWS_DEFAULT_REGION=us-west-2  -w /app hashicorp/terraform:0.12.26 apply      -input=false tfplan 
```

The resource for the `$default` route still is created without a route_key:

```
 # aws_apigatewayv2_route.this["default"] will be created
  + resource "aws_apigatewayv2_route" "this" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + target             = (known after apply)
    }
```

See missing property `route_key`

Other routes are created correctly and include this property:

```
  # aws_apigatewayv2_route.this["ANY /user"] will be created
  + resource "aws_apigatewayv2_route" "this" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "ANY /user"
      + target             = (known after apply)
    }
```
